while True:
    v = int(input("Please enter the speed:"))
    F = [221.7,213.6,205.3,197.1,188.9,180,168.3,160.9,156,127,120,114,106]
    w0d = 1.02 + 0.0035 * v + 0.000426 * v * v
    ww0d = (176 * w0d * 9.81)/1000
    w0dd = 0.92 + 0.0048 * v + 0.000125 * v * v
    ww0dd = (5000 * w0dd * 9.81)/1000
    ww0 = ww0d + ww0dd
    cc = F[int(v//10-1)] * 2 - ww0
    #cc = 254  - ww0
    cq = (cc * 1000)/((176 + 5000) * 9.81)
    cd = (-ww0 * 1000)/((176 + 5000) * 9.81)
    vj = 0.356 * (0.4 * v + 100)/(4 * v + 100)
    b = 1000 * 0.36 * vj
    cz = -(0.5 * b - cd)
    print(
        " 机车单位基本阻力:",w0d ,"\n",
        "机车基本阻力:",ww0d ,"\n",
        "车辆单位基本阻力:",w0dd ,"\n",
        "车辆基本阻力:",ww0dd ,"\n",
        "列车基本阻力:",ww0 ,"\n",
        "牵引运行时作用于列车的合力:",cc ,"\n",
        "牵引运行时列车受到的单位合力:",cq ,"\n",
        "惰行时列车单位基本阻力:",cd ,"\n",
        "闸瓦换算摩擦系数:",vj ,"\n",
        "列车单位制动力:",b ,"\n",
        "常用制动时的列车单位合力:",cz ,"\n"
    )